---
title: VoltageTypeSet
classe: Autodesk.Revit.DB.Electrical.VoltageTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# VoltageTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `voltageTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `voltageTypeSet.Size` | Int32 |
| `Void Clear()` | `voltageTypeSet.Clear()` | Void |
| `Boolean Contains(VoltageType)` | `voltageTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(VoltageType)` | `voltageTypeSet.Erase(item)` | Int32 |
| `VoltageTypeSetIterator ForwardIterator()` | `voltageTypeSet.ForwardIterator()` | VoltageTypeSetIterator |
| `IEnumerator GetEnumerator()` | `voltageTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(VoltageType)` | `voltageTypeSet.Insert(item)` | Boolean |
| `VoltageTypeSetIterator ReverseIterator()` | `voltageTypeSet.ReverseIterator()` | VoltageTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```